<?php
$id = isset($_GET['id']) ? $_GET['id'] : 'cctv1';
$n = [
    'cctv1' => '608807420',
    'cctv2' => '631780532',
    'cctv3' => '624878271',
    'cctv4' => '631780421',
    'cctv4a' => '608807416',
    'cctv4o' => '608807419',
    'cctv5' => '641886683',
    'cctv5p' => '641886773',
    'cctv6' => '624878396',
    'cctv7' => '673168121',
    'cctv8' => '624878356',
    'cctv9' => '673168140',
    'cctv10' => '624878405',
    'cctv11' => '667987558',
    'cctv12' => '673168185',
    'cctv13' => '608807423',
    'cctv14' => '624878440',
    'cctv15' => '673168223',
    'cctv17' => '673168256',

    'fyjc' => '695866809', //CCTV风云剧场x

    'fxzl' => '624878970', //央视新影－发现之旅
    'zxs' => '708869532', //央视新影－中学生

    'cgtn' => '609017205', //CGTN
    'cgtnjl' => '609006487', //CGTN纪录
    'cgtna' => '609154345', //CGTN阿拉伯语
    'cgtnf' => '609006476', //CGTN法语
    'cgtne' => '609006450', //CGTN西班牙语
    'cgtnr' => '609006446', //CGTN俄语

    'dfws' => '651632648', //东方卫视*
    'cqws' => '738910914', //重庆卫视
    'jlws' => '738906889', //吉林卫视
    'lnws' => '630291707', //辽宁卫视高清
    'nmws' => '738911430', //内蒙古卫视
    'nxws' => '738910535', //宁夏卫视
    'gsws' => '738910997', //甘肃卫视
    'qhws' => '738898486', //青海卫视
    'sxws' => '738910838', //陕西卫视
    'sdws' => '738910366', //山东卫视
    'hubws' => '738906825', //湖北卫视高清
    'jxws' => '738906895', //江西卫视高清
    'jsws' => '623899368', //江苏卫视高清
    'gdws' => '608831231', //广东卫视高清
    'dwqws' => '608917627', //大湾区卫视
    'scws' => '738910804', //四川卫视
    'xjws' => '738910476', //新疆卫视
    'xzws' => '738910461', //西藏卫视
    'hinws' => '738906860', //海南卫视

    'shdy' => '721355039', //四海钓鱼

    'dfys' => '617290047', //东方影视高清
    'shxwzh' => '651632657', //上海新闻综合高清
    'dycj' => '608780988', //第一财*
    'shds' => '674934424', //上海都市高清
    'shjsrw' => '617289997', //纪实人文高清
    'shics' => '618954688', //上海ICS
    'hhxd' => '651638619', //哈哈炫动
    'fztd' => '631095330', //法治天地

    'lttv' => '668225749', //临洮电视台

    'hzgg' => '650217163', //汉中公共
    'hzjy' => '728987081', //汉中教育
    'lbtv' => '651810498', //留坝电视台
    'lytv' => '684003723', //略阳电视台
    'mxtv' => '731984452', //勉县电视台
    'nqtv2' => '684004345', //宁强电视台2

    'clzh' => '733532221', //昌黎综合*

    'sdjy' => '609154353', //山东教育

    'jyjs' => '623604663', //金鹰纪实

    'jscs' => '626064714', //江苏城市
    'jszy' => '626065193', //江苏综艺
    'jsys' => '626064697', //江苏影视*
    'jsgg' => '626064693', //江苏公共新闻
    'jsgj' => '626064674', //江苏国际
    'jsjy' => '628008321', //江苏教育
    'jsty' => '626064707', //江苏体育休闲
    'jsxx' => '626881786', //江苏学习
    'hxgw' => '626064668', //好享购物
    'jslz' => '626064675', //江苏靓妆
    'ymkt' => '626064703', //优漫卡通

    'szzh' => '639731952', //苏州新闻综合
    'sqzh' => '639731832', //宿迁新闻综合
    'hazh' => '639731826', //淮安新闻综合
    'xzzh' => '639731747', //徐州新闻综合
    'wxzh' => '639737327', //无锡新闻综合
    'zjzh' => '639731783', //镇江新闻综合
    'tzzh' => '639731818', //泰州新闻综合
    'lygzh' => '639731715', //连云港新闻综合

    'gdys' => '614961829', //广东影视*
    'jjkt' => '614952364', //嘉佳卡通

    '24hty' => '654102378', //咪咕24小时体育台
    'agyz' => '625526423', //爱国影展
    'bkdhdy' => '625204865', //爆款动画电影
    'cawyyy' => '715451506', //纯爱文艺影院
    'clzpj' => '707671890', //成龙作品集
    'cuva' => '712723873', //CUVA频道
    'dkzxc' => '685902450', //大咖在现场
    'dmffl' => '625525181', //盗墓方法论
    'dzjc' => '634274665', //红色谍战剧场
    'glzpj' => '639528313', //古龙作品集
    'gnslsk' => '625542365', //高能烧脑时刻
    'gqdp' => '629943678', //高清大片
    'hjlp' => '621640582', //怀旧老片
    'hslbt' => '713600957', //红色轮播台
    'jddh' => '629942219', //经典动画
    'jdfyt' => '685902551', //经典放映厅
    'jdys' => '627198751', //经典影视速看
    'jkzg' => '685902423', //健康中国
    'jljc' => '625643517', //军旅剧场
    'jsdp' => '617432318', //军事大片
    'jypd' => '625774640', //金庸频道
    'jyyy' => '625681367', //解压影院
    'ldhyy' => '659315648', //刘德华影院
    'lzujc' => '659315648', //林正英剧场*
    'mgdjfs' => '625498432', //咪咕独家放送
    'mgdysk' => '639528386', //美国电影时刻
    'rjlb' => '629943613', //热剧联播
    'sddh' => '637483721', //试胆大会
    'slzgf' => '639528330', //少林真功夫
    'snh' => '639528180', //SNH48剧场公演
    'sszjd' => '646596895', //赛事最经典
    'ttmlh' => '629943305', //体坛名栏汇
    'txkdy' => '627198822', //泰想看电影
    'tyys' => '625774662', //体育影视
    'wpdwp' => '627198692', //王牌对王牌
    'wqclyy' => '627198191', //温情催泪影院
    'xczx' => '713589837', //乡村振兴
    'xjlm' => '637444830', //喜剧联盟
    'xpfyt' => '619495952', //新片放映厅
    'ydsp' => '625155140', //印度神片
    'ydyyx' => '625133682', //运动员演戏
    'ynkhy' => '625703337', //约你看韩影
    'ytya' => '625542372', //粤听粤爱
    'yxels' => '713599117', //影像俄罗斯
    'zgryy' => '707689526', //张国荣影院
    'zhyl' => '617432328', //智慧养老
    'zjys' => '685902264', //走进艺术
    'sjbyzds' => '625759558', //世界杯遗珠大赏
    'zqzyp' => '629942228', //最强综艺趴
    'zmjt' => '627198610', //筑梦九天
    'zrfyy' => '639526984', //周润发影院
    'zxcyy' => '623338112', //周星驰影院
    'zyxc' => '621640581', //综艺现场
];

$d = file_get_contents('http://m.miguvideo.com/playurl/v1/play/playurlh5?&rateType=3&contId=' . $n[$id]);
$e = json_decode($d)->body->urlInfo->url;
$userid = str_split("");
$timestamp = str_split(explode('=', explode('&', $e)[6])[1]);
$ProgramID = str_split($n[$id]);
$Channel_ID = str_split("0116_25000000-99000-100300010010001");
$puData = str_split(explode('=', explode('&', $e)[21])[1]);
$number = str_split("2624");
$s = count($puData);
for ($v = 0; $v < $s / 2; $v++) {
    $arr_key[] = $puData[$s - $v - 1];
    $arr_key[] = $puData[$v];
    switch ($v) {
        case 1:
            $chars = $userid[$number[0]];
            $arr_key[] = arrkey($chars, $v);
            break;
        case 2:
            $chars = $timestamp[$number[1]];
            $arr_key[] = arrkey($chars, $v);
            break;
        case 3:
            $chars = $ProgramID[$number[2]];
            $arr_key[] = arrkey($chars, $v);
            break;
        case 4:
            $chars = $Channel_ID[count($Channel_ID) - $number[3]];
            $arr_key[] = arrkey($chars, $v);
            break;
    }
}
$ddCalcu = join($arr_key);

function arrkey($chars, $v)
{
    $put = ['e', 't', 'c', 'n'];
    if ($chars !== null) {
        $mark = $chars;
    } else {
        $mark = $put[$v - 1];
    }
    return $mark;
}

$p = $e . "&ddCalcu=" . $ddCalcu;
$headers = get_headers($p, true);
$url = $headers["Location"];
$path = parse_url($url)['path'];
$query = parse_url($url)['query'];
$playurl = 'http://h5.live.miguvideo.com' . $path . '?' . $query;
header('Location:' . $playurl);
?>